# Manipulação EDA da base de dados Titanic

## Importando pacotes e bibliotecas

In [1]:
from matplotlib import pyplot as plt
import seaborn as sas
import pandas as pd
import numpy as np
#---
from utils.tratar_dados import *
from utils.funcoes_graficas import *

## Importando base de dados

### Importando de um .csv

In [2]:
file_name = "titanic"
titanic_dataframe = read_data(file_name)

Read from .pkl file format

### Importando de um .pkl

In [3]:
file_name = "titanic"
titanic_dataframe = read_data(file_name)

Read from .pkl file format

## Tratamento dos dados

### Passando os títulos para minúsculo

In [4]:
titulos = titanic_dataframe.columns
titulos = fix_header_to_standarts(titulos)
titanic_dataframe.columns = titulos

### Remoção de espaços

In [5]:
# Nao foi necessario

### Remoção de caracteres proibidos

In [6]:
# Nao foi necessario

### Normalização dos dados

In [7]:
titanic_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  418 non-null    int64
 1   survived     418 non-null    int64
 2   pclass       418 non-null    int64
 3   name         418 non-null    object
 4   sex          418 non-null    object
 5   age          332 non-null    float64
 6   sibsp        418 non-null    int64
 7   parch        418 non-null    int64
 8   ticket       418 non-null    object
 9   fare         417 non-null    float64
 10  cabin        91 non-null     object
 11  embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [8]:
titanic_dataframe.sample(10)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
86,978,1,3,"Barry, Miss. Julia",female,27.0,0,0,330844,7.8792,NaN,Q
118,1010,0,1,"Beattie, Mr. Thomson",male,36.0,0,0,13050,75.2417,C6,C
337,1229,0,3,"Elias, Mr. Joseph",male,39.0,0,2,2675,7.2292,NaN,C
166,1058,0,1,"Brandeis, Mr. Emil",male,48.0,0,0,PC 17591,50.4958,B10,C
299,1191,0,3,"Johansson, Mr. Nils",male,29.0,0,0,347467,7.8542,NaN,S
344,1236,0,3,"van Billiard, Master. James William",male,NaN,1,1,A/5. 851,14.5000,NaN,S
256,1148,0,3,"Mahon, Mr. John",male,NaN,0,0,AQ/4 3130,7.7500,NaN,Q
134,1026,0,3,"Dintcheff, Mr. Valtcho",male,43.0,0,0,349226,7.8958,NaN,S
223,1115,0,3,"Karlsson, Mr. Einar Gervasius",male,21.0,0,0,350053,7.7958,NaN,S
350,1242,1,1,"Greenfield, Mrs. Leo David (Blanche Strouse)",female,45.0,0,1,PC 17759,63.3583,D10 D12,C

#### Tratamento de NaNs

##### Coluna "cabin"

In [9]:
coluna_cabine = "cabin"
for coluna in titanic_dataframe.columns:
    if coluna_cabine == coluna:
        titanic_dataframe[f"{coluna}"] = titanic_dataframe[f"{coluna}"].fillna("Unknown")


titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
139,1031,0,3,"Goodwin, Mr. Charles Frederick",male,40.0,1,6,CA 2144,46.9000,Unknown,S
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
262,1154,1,2,"Wells, Mrs. Arthur Henry (Addie"" Dart Trevaskis)""",female,29.0,0,2,29103,23.0000,Unknown,S
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,Unknown,S

##### Coluna "age"

In [10]:
coluna_cabine = "age"
media = int(round(titanic_dataframe.age.mean(), 0))

for coluna in titanic_dataframe.columns:
    if coluna_cabine == coluna:
        titanic_dataframe[f"{coluna}"] = titanic_dataframe[f"{coluna}"].fillna(media)


titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Unknown,Q
365,1257,1,3,"Sage, Mrs. John (Annie Bullen)",female,30.0,1,9,CA. 2343,69.5500,Unknown,S
57,949,0,3,"Abelseth, Mr. Olaus Jorgensen",male,25.0,0,0,348122,7.6500,F G63,S
94,986,0,1,"Birnbaum, Mr. Jakob",male,25.0,0,0,13905,26.0000,Unknown,C
114,1006,1,1,"Straus, Mrs. Isidor (Rosalie Ida Blun)",female,63.0,1,0,PC 17483,221.7792,C55 C57,S

##### Coluna "embarked"

In [11]:
titanic_dataframe.embarked.unique()

array(['Q', 'S', 'C'], dtype=object)

In [12]:
# NAO EXECUTE ESSA CELUNA MAIS DE UMA UNICA VEZ
titanic_dataframe.embarked = titanic_dataframe.embarked.map({
    "C": 0,
    "Q": 1,
    "S": 2
    }
)

In [13]:
titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
338,1230,0,2,"Denbury, Mr. Herbert",male,25.0,0,0,C.A. 31029,31.500,Unknown,2
63,955,1,3,"Bradley, Miss. Bridget Delia",female,22.0,0,0,334914,7.725,Unknown,1
247,1139,0,2,"Drew, Mr. James Vivian",male,42.0,1,1,28220,32.500,Unknown,2
317,1209,0,2,"Rogers, Mr. Reginald Harry",male,19.0,0,0,28004,10.500,Unknown,2
365,1257,1,3,"Sage, Mrs. John (Annie Bullen)",female,30.0,1,9,CA. 2343,69.550,Unknown,2

##### Coluna "sex"

In [14]:
titanic_dataframe.sex.unique()

array(['male', 'female'], dtype=object)

In [15]:
# NAO EXECUTE ESSA CELUNA MAIS DE UMA UNICA VEZ
titanic_dataframe.sex = titanic_dataframe.sex.map({
    "male": 0,
    "female": 1
    }
)

In [16]:
titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
42,934,0,3,"Goldsmith, Mr. Nathan",0,41.0,0,0,SOTON/O.Q. 3101263,7.850,Unknown,2
197,1089,1,3,"Nilsson, Miss. Berta Olivia",1,18.0,0,0,347066,7.775,Unknown,2
11,903,0,1,"Jones, Mr. Charles Cresson",0,46.0,0,0,694,26.000,Unknown,2
124,1016,0,3,"Kennedy, Mr. John",0,30.0,0,0,368783,7.750,Unknown,1
52,944,1,2,"Hocking, Miss. Ellen Nellie""""",1,20.0,2,1,29105,23.000,Unknown,2

#### Tratamento de tipos

In [17]:
id_max = titanic_dataframe.passengerid.max()
fare_max = round(titanic_dataframe.fare.max(), 2)
print(f"O maior id é:\t\t{id_max}\nA maior tarifa é:\t{fare_max}\n")

O maior id é:		1309
A maior tarifa é:	512.33

In [18]:
### coluna passengerid
titanic_dataframe.passengerid = titanic_dataframe.passengerid.astype("uint16")

### coluna survided
titanic_dataframe.survived = titanic_dataframe.survived.astype("uint8")

### coluna pclass

### coluna name

### coluna sex

### coluna age

### coluna sibsp

### coluna parch

### coluna tiicket

### coluna fare

### coluna cabin

### coluna embarked